class Data{

  List<String> as2ela1=[
    "رائحة الفم الكريهة",
    "التهاب أعصاب الأسنان",
    "تغيير لون الأسنان",
    "التهاب اللثة",
    "خرّاج الأسنان",
    "قرحة الفم",
    "جفاف الفم",
    "صدمة قوية أو حادثة للأسنان",
    "تسوس الأسنان",
    "سرطان الفم",
    "الأكياس السنية",
    "تخلخل الاسنان",
    "لمعرفة الفرق بين آلام الأسنان المختلفة"
  ];

  List<String> as2ela2=[
    '''خدعوك فقالوا انك إذا قمت بعمل تنظيف لأسنانك سوف يتغير لونها! ''',
'''خدعوك فقالوا أن الجير المتراكم علي الأسنان يحميها من التساقط ويقويها وانك إذا قمت بإزالته عند طبيب الأسنان سوف تظهر مسافات بين الأسنان وبعضها وسوف تفقد ثباتها!''',
    '''خدعوك فقالوا أن الأسنان مثل الحجارة وتحتاج لفرشاة شعيراتها قاسية ليتم تنظيفها!''',
    '''خدعوك فقالوا أن ضرس العقل له علاقة بالعقل!''',
    '''خدعوك فقالوا أن معجون الأسنان يحتوي على مادة الفلورايد السامة!''',
    '''خدعوك فقالوا أن استخدام الليمون لتبيض الاسنان كبديل لشغل طبيب الأسنان!''',
    '''خدعوك فقالوا أن الأطفال الصغار لا تحتاج لزيارة طبيب الأسنان!''',
    '''خدعوك فقالوا أن النعناع هو سر رائحة النفس المنعشة!''',
    '''خدعوك فقالوا أن كثرة غسيل الأسنان مستحب!''',
    '''خدعوك فقالوا أن العلاج بالليزر خطير بسبب الإشعاع''',
    '''خدعوك فقالوا أنه يجب التوجه إلى طبيب الأسنان فقط عندما لا يكون هناك خيار اخر''',
    '''خدعوك فقالوا أنه إذا كنت تشعر بالألم بعد علاج قناة الجذر السبب هو ان طبيب الأسنان ليس جيد''',
    '''خدعوك فقالوا أنه يجب خلع كل ضروس العقل''',
    '''خدعوك فقالوا أنه إذا كان هناك نزيف في اللثة فلا يجب فرك الأسنان''',
    '''خدعوك فقالوا أنه تمنع النساء الحوامل من اجراء فحوص التصوير بالأشعة السينية لدى طبيب الأسنان''',
    '''خدعوك فقالوا أنه يوصى بتجنب علاجات الأسنان أثناء فترة الحمل''',
    '''خدعوك فقالوا أن العلكة (اللبان) يؤدي لإزالة الحشوات''',
  ];
  List<String> as2ela3=[
    '''خلع الأسنان''',
    '''علاج الجذور''',
    '''حشو الأسنان''',
    '''تلبيس الأسنان''',
    '''زراعة الأسنان''',
    '''تبييض الأسنان''',
    '''كسوة الأسنان''',
    '''جراحة دواعم السن'''
  ];

  List<String> as2ela5=[
    '''المفصل الفكي الصدغي (TMJ)''',
    '''خيط الأسنان (dental floss)''',
    '''تنظيف فرشاة الأسنان''',
    '''تعليمات بعد خلع الأسنان''',
    '''ضرس العقل''',
    '''السكر وتسوس الأسنان''',
    '''البلاك والجير''',
    '''الأسنان اللبنية والتسوس''',
    '''آثار التدخين على صحة الفم والأسنان''',
    '''تأثير الإجهاد والضغط النفسي على صحة الفم والأسنان''',
    '''أضرار المشروبات الغازية والسكر''',
    '''معلومات سريعة'''
  ];


  List<String> info1=[
    '''ما هي رائحة الفم الكريهة أو بخر الفم؟
  رائحة الفم عرض مرضي تكون ناتجة في كثير من الأحيان عن إهمال صحة الفم بالذات وإهمال العناية به وقد تكون لأسباب أخرى عامة

  أسبابه :
  - سوء حالة نظافة الفم والأسنان
  - تسوسات الأسنان
  - تناول أطعمة معينة
  - التهاب اللثه
  - وجود حشوات وتركيبات رديئة
  - جفاف الفم
  - التدخين

  أسباب أخرى مثل :
  - العدوى المزمنة في الأنف والجيوب الأنفية
  - بعض أمراض الجهاز الهضمي : التخمة، أمراض الكبد، داء السكري
  - أمراض الجهاز التنفسي
  - أمراض الدم

  للحد من النفس السئ أو الوقاية منه :

  - غسل الأسنان بالفرشاة لمدة دقيقتين مرتين يومياً (لا تنس تفريش اللسان)
  - استخدام خيط الأسنان مرة على الأقل كل يوم
  - تنظيف التركيبات الصناعية أو أجهزة الأسنان
  - استبدال فرشاة الأسنان بأخرى جديدة بانتظام
  - الزيارة الدورية لطبيب الأسنان
  - تجنب جفاف الفم
  - ظبط النظام الغذائي''',
    '''أعراض التهاب أعصاب الأسنان فيما يلى:
 
1- الشعور بوخز أو نبضات بالأسنان المنطقة أسفل اللثة
 
2- الشعور بصداع مستمر لفترات طويلة وخاصة إذا كان الصداع فى نصف الوجه
 
3- فى حال التهاب عصب ضرس العقل، يشعر المريض بآلام فى الأذن وخلفها.
 
4- فى حالة أن السن أو الضرس المصاب بالتهاب العصب فى الفك العلوى  يجد المريض صعوبة فى التركيز بالعين
 
5- الشعور بآلام شديدة فى الأسنان خاصة أثناء تناول المشروبات الباردة والساخنة، أو تناول الأطعمة التى تحتوى على السكريّات والحلويات
 
6- آلام شديدة تزداد ليلاً وقد توقظ المريض من النوم أو يجد صعوبة فى النوم بسببها.

أسباب الإصابة بالتهاب عصب الأسنان وجود عدة عوامل منها:
 
1- التعرض لكسور فى الأسنان تصل إلى لب السن وعصبه
 
2- إهمال نظافة الفم والأسنان مما يؤدى إلى تسوسها وإهمال علاجه الذى يسبب التهاب عصب الأسنان
 
3- الإهمال فى علاج الأسنان حال التهابها ما يهدد بمضاعفات خطيرة منها وصول الالتهابات لعصب السن
 
4- إهمال علاج اللثة الملتهبة وبالتالى قد تصل هذه الالتهابات إلى جذور الأسنان ومن ثم إلى عصبها.
 
يجب التوجه لطبيب الأسنان فى حالة وجود التهابات فى أعصاب الأسنان ليقوم بعلاجها من خلال علاج الجذور أو إزالة العصب الملتهب والمتسبب فى هذه الآلام، وعمل حشو للضرس منعا للدخول فى مضاعفات، بعد ذلك يتم تركيب الـ"طربوش" لحماية السن من الكسر.

''',
       '''قد يتغير لون الأسنان بسبب عادات خاطئة يفعلها الإنسان مثل الإهمال فى تنظيف الأسنان أو عادة التدخين أو شرب المكيفات التى تحتوى على الكافيين، وقد يكون السبب فى تغير لون الأسنان أيضًا الإصابة فى مرحلة الطفولة بكسر فى أحد الأسنان، خاصة فى تلك المرحلة التى لا تتغير فيها الأسنان.
''',
    '''هو مرض شائع من أمراض اللثة، ويتسبب في تهيج واحمرار وتورم اللثة، وهو الجزء المحيط بجذور الأسنان، ومن المهم أخذ التهاب اللثة بجدية ومعالجته دون إبطاء، حيث إنه قد يؤدي إلى مرض لثوي آخر أكثر خطورة ويدعى التهاب دواعم السن وفقدان الأسنان.
 
أعراض التهاب اللثة
تتضمن علامات وأعراض التهاب اللثة ما يلي:
 
-لثة متورمة أو منتفخة.
 
-احمرار اللثة الداكن أو اللثة الحمراء القاتمة.
 
-اللثة التي تنزف بسهولة عند غسل الأسنان أو تنظيفها بالخيط.
 
-رائحة النفس الكريهة.
 
-انحسار اللثة.
 
-ضعف اللثة.
 
ويعد السبب الأكثر شيوعًا في التهاب اللثة هو قلة الاهتمام بنظافة الفم، حيث إن عادات نظافة الفم الصحية، مثل غسل الأسنان بالفرشاة مرتين يوميًا على الأقل، واستخدام خيط تنظيف الأسنان يوميًا، وفحص الأسنان دوريًا، يمكنه أن يساعد على
منع آثار التهاب اللثة.

أسباب التهاب اللثة
أكثر أسباب التهاب اللثة شيوعًا، هو الناتج عن سوء نظافة الفم والتي تشجع تكوَّن القلح على الأسنان، ما يؤدي إلى حدوث التهاب في أنسجة اللثة المحيطة، وهذه هي الحالة التي قد يؤدي فيها القلح إلى التهاب اللثة.
 
تشكل القلح على الأسنان
هو عبارة عن غشاء غير مرئي ودبق يتكون أساسًا من البكتريا التي تتكون على الأسنان عند تفاعل السكريات والنشويات الموجودة في الطعام مع البكتريا الموجودة في العادة داخل فم المريض، ويحتاج القلح إلى الإزالة اليومية لأنه يعيد تكوين نفسه بسرعة.
 
تحول القلح إلى جير
من الممكن أن يتصلب القلح المتبقي على أسنان المريض تحت خط اللثة، ويتحول إلى جير، والذي يجمع البكتيريا، ويصعِّب الجير إزالة القلح حيث يكوّن طبقة واقية للبكتيريا ويسبب التهيج على طول خط اللثة، وفي هذه الحالة يحتاج المريض إلى الذهاب لطبيب الأسنان لإزالة الجير.
 
علاج التهاب اللثة
تعد أفضل طريقة لنجاح العلاج هي اعتماد روتين يومي من العناية الجيدة بالفم والإقلاع عن التدخين.
 
وتشمل العناية المتخصصة لالتهاب اللثة ما يلي:
 
تنظيف الأسنان المتخصص، ويشمل التنظيف المتخصص الأولي إزالة جميع آثار الجير والقلاح وترسبات البكتيريا، ويُسمى هذا الإجراء إزالة الجير وكشط الجذر، حيث يزيل التقشير الجير والبكتيريا من أسطح الأسنان وتحت اللثة، ويزيل كشط الجذر ترسبات البكتيريا الناتجة عن الالتهاب، وينعم أسطح الجذر مما يوقف تراكب القلاح والبكتيريا، ويتم هذا الإجراء باستخدام أدوات أو جهاز ليزر أو جهاز موجات فوق الصوتية.
 
ترميم الأسنان، إذا لزم الأمر، حيث قد تسبب الأسنان غير المصطفة أو تيجان الأسنان ذات المقاسات الخطأ أو الجسور أو تركيبات الأسنان الأخرى تهيج اللثة، ما يصعب إزالة الجير خلال روتين العناية بالفم اليومية.
 
يعالج التهاب اللثة بعد التنظيف الشامل عادة، طالما حافظ المريض على نظافة فمه في المنزل.
''',
    '''تتضمن علامات وأعراض خراج الأسنان ما يلي:
 
-وجع الأسنان الحاد والمستمر والنابض الذي يمكن أن ينتشر إلى عظم الفك أو الرقبة أو الأذن.
-الحساسية لدرجات الحرارة الباردة والساخنة.
-الحساسية للضغط عند المضغ أو العض.
-الحُمّى
-تورم في الوجه أو الخد.
-الشعور بالألم، وتورم الغدد الليمفاوية تحت الفك أو في الرقبة.
-الاندفاع المفاجئ لرائحة كريهة وسيئة المذاق، وسوائل مالحة في فمك، وانخفاض الألم إذا انفجر الخراج.
-صعوبة في التنفس أو البلع.
 
اذهب إلى طبيب الأسنان على الفور إذا ظهرت عليك أعراض أو علامات تشير إلى وجود خراج في الأسنان.
 
إذا كنت تشعر بحمى، أو تورم في وجهك، ولم تستطع الوصول إلى طبيب الأسنان، فاذهب إلى غرفة الرعاية الطبية الطارئة.
واذهب إلى غرفة الرعاية الطبية الطارئة إذا كانت لديك مشكلات في التنفس، أو بعض التورم. فقد تشير هذه الأعراض إلى إصابتك بعدوى تنتشر بعمق في الفك، والأنسجة المحيطة به، أو حتى في مناطق أخرى من جسمك.
 
سيعالج أطباء الأسنان خراج الأسنان من خلال تصريفه والتخلُّص من العدوى.
قد يكونون قادرين على حفظ أسنانك باستخدام علاج القناة الجذرية، ولكن في بعض الحالات قد يتطلَّب الأمر خلع السن.
إن تَرْك خراج الأسنان دون معالجته قد يؤدي إلى مضاعفات خطيرة، أو حتى مهدِّدة للحياة.''',
   '''عادة ما تكون القروح غير خطرة، ولكن في حال استمرت قرحة الفم لمدة تزيد عن 3 أسابيع، فيجب عليك فحصها من قبل طبيب الأسنان بشكل عاجل، لأنها قد ترتبط بأعراض خطرة، مثل الإصابة بالسرطان.''',
    '''اعتاد الأطباء على الاعتقاد بأن جفاف الفم (زيروستوميا) كان جزءًا طبيعيًا من كبر السن.
والآن هم يعلمون أن ذلك ليس صحيحًا.
حيث لا يجب أن يعاني البالغون الأكبر سنًا والذين يتمتعون بصحة جيدة من مشكلة باللعاب.
يحدث جفاف الفم حين لا تعمل الغدد اللعابية بشكل صحيح.
ويمكن لهذا أن يصعب تناول الطعام، والبلع، والتذوق وحتى التحدث.
ويمكن لجفاف الفم أيضًا أن يزيد من احتمالية تسوس الأسنان والعدوى.
ويمكن أن تعاني من جفاف الفم كنتيجة لأمراض كثيرة أو علاجات طبية، مثل العلاج الإشعاعي للرأس والعنق. ويمكن لكثير من الأدوية أيضًا أن تسبب جفاف الفم.
 
إذا كنت تعتقد أنك تعاني من جفاف الفم، تحدث مع طبيب الأسنان أو الطبيب لاكتشاف السبب.
وإذا كان جفاف الفم لديك ناتجًا عن دواء تتناوله، قد يغير الطبيب الدواء أو الجرعة.
 
لمنع الجفاف، اشرب المزيد من الماء.
وقلل من الوجبات الخفيفة السكرية، والمشروبات التي تحتوي على الكافيين أو الكحول، والتبغ.
وقد يقترح طبيب الأسنان أو الطبيب أيضًا أن تبقي فمك رطبًا باستخدام لعاب صناعي والذي يمكن أن تحصل عليه من معظم الصيدليات.
وقد يستفيد بعض الناس من مص حلوى صلبة.''',
    '''هي اصابة الاسنان و الانسجة المحيطة بها عن طريق صدمة قوية بها مثل الوقوع على الأسنان
وعادة ما تكون منتشرة بين الاطفال لفرط حركتهم وكثرة لعبهم
 
ومن الأشياء الأكثر شيوعاً التي تحدث
ان السنه :
١) تتكسر broken
٢) تتخلع من مكانها extracted
٣) تظل مكانها لكن تموت نتيجه لموت العصب الموجود بداخلها بسبب الصدمة.
 
هل الـ trauma هي السبب الوحيد لموت الأسنان ؟
 
لا .. يمكن للتسوس الحاد في الأسنان أيضاً ان يتسبب في موتها.
 
أشياء يجب عليك معرفتها واتباعها إذا تعرضت للـ trauma او تعرض إليها شخص تعرفه :
 
 
١) اولاً يجب الاطمئنان على الشخص الذي تعرض للـ truma هل توجد أي إصابات أخرى في أي مكان في جسمه أم لا.
 
٢) اجراءات بخصوص السنه التي تعرضت للـ trauma :
 
أ) إذا تعرضت السنه للخلع من مكانها :
 
التوجه لطبيب الأسنان لو امكن في اسرع وقت ونضع السنه في لبن أو منديل مبلل،
وطبيب الأسنان سوف يقوم بإرجاعها إلى مكانها وبالتأكيد ستقوم بالمتابعة حتى تثبت السنة في مكانها مرة أخرى لكن غالبا سوف تحتاج إلى علاج عصب.
 
ب) إذا تعرضت السنه للكسر :
سوف يكون على حسب الكسر :
 
* إذا كان جزءاً بسيطا منها *
فـ سوف تحتاج لحشو تجميلي او تاج.
 
* ٱذا كان جزءاً كبيراً من السنه قد تعرض للكسر متضمناً العصب او قريباً منه *
فـ سوف تحتاج إلى علاج عصب وتاج.
 
* إذا لم يحدث شيئاً للسنه *
سوف نتابع تغير لون السنه :
 
إذا ظهرت نقط سوداء، هذا يعني أن العصب قد مات
 
وإذا لم يطرأ أي تغيير في السنه يعني أن الأمور على ما يرام.''',
    ''' أعراض تسوس الأسنان
 
الأعراض الأولية لتطور تسوس الاسنان تختلف من حالة إلى أخرى، وهي تتعلق بدرجة التسوس وموقعه.
 
فالتسوس في بدايته قد لا يكون مصحوبا بأية أعراض أو علامات.
لكن، كلما اشتد التسوس، فقد تظهر أعراض مختلفة، منها:
 
-آلام الأسنان
-حساسية الأسنان
-آلام طفيفة أو حادة عند تناول أطعمة ساخنة أو باردة أو مشروبات محلّاة (وهي آلام تستمر حتى بعد الانتهاء من الأكل أو الشرب)
-ثقوب أسنان يمكن ملاحظتها بالعين
-ألم عند قضم الطعام
-ظهور قيح (صديد) حول السن
 
مضاعفات تسوس الأسنان
 
تسوس الاسنان منتشر بشكل واسع جدا إلى درجة إن كثيرين من الناس لا يتعاملون معه بالجديّة المناسبة.
إلا إن تسوس الاسنان قد يؤدي إلى مضاعفات وتعقيدات خطيرة وبعيدة المدى، حتى لدى الأطفال الذين لم تنبت أسنانهم الثابتة بعد.  
 
من بين هذه المضاعفات:
 
-أوجاع
-خُراج (Abscess) في الأسنان
-تساقط الأسنان
-تكسّر الأسنان
-مشاكل في المضغ
-التهابات حادة
علاج تسوس الأسنان
 
علاج تسوس الاسنان يتعلق، بشكل كبير، بدرجة التسوس ومدى خطورته وبالحالة الصحية بشكل عام.
 
من بين ما تشمله العلاجات:
 
-العلاج بالفلوريد
-الحشوات المركّبة أو: الحشوات التعويضية
-علاج جذر السن (أو: علاج العصب)
-التاج (غطاء كامل للسن يستخدم لترميم وإصلاح الأسنان التالفة)
-خلع (قلع الأسنان).
 ''',
    ''' في معظم الأحيان يصيب سرطان الفم الأشخاص الأكبر من 40 سنة.
ومن المهم اكتشاف سرطان الفم مبكرًا، لأن العلاج يعطي أفضل النتائج قبل انتشار المرض.
وغالبًا لا يكون الألم هو العرض المبكر للمرض.
 
إن فحص الأسنان هو الوقت المناسب لطبيب الأسنان للبحث عن العلامات المبكرة لسرطان الفم.
وحتى إذا كنت قد فقدت كل أسنانك الطبيعية، ما زال يجب عليك أن ترى طبيب الأسنان للفحوصات المنتظمة لسرطان الفم.
اذهب لطبيب الأسنان أو الطبيب إذا كنت تعاني من مشكلة التورم، أو التنميل، أو القرح أو وجود كتل في فمك، أو إذا أصبح من الصعب عليك أن تمضغ، أو تبلع أو تحرك فكك أو لسانك.
وقد تكون هذه المشاكل علامات لسرطان الفم.
 
إليك كيف يمكنك أن تقلل احتمالية الإصابة بسرطان الفم: لا تدخن؛ ولا تستخدم النشوق أو تمضغ التبغ؛ ولا تشرب الكحول؛ واستخدم كريمًا للشفاه واقيًا من الشمس؛ وتناول الكثير من الفواكه والخضروات.''',
    ''' يسبب الكيس آلامًا مبرحة، قد يسبب أيضًا تورمًا في المنطقة حيث يتواجد.
هذا يمكن أن يضغط على الأسنان الأخرى ويجعلها تتعرض للامتصاص (التآكل) بسرعة.
وهذا بدوره، يُسبب لبعض الأسنان الأخرى ألمًا شديدًا أو حتى تسوسًا.
  قد يلجأ الطبيب إلى المداواة اللبية لمعالجة الأكياس السنية.
يحدث هذا عندما استئصال اللب المصاب بالإنتان وتنظيف الجذر جيدًا، وذلك لمنع خطر الإصابة بعدوى مستقبلية جديدة.
تُجرى المداواة (المعالجة) اللبية عن طريق استخدام مادة تشبه الإبرة وإدخالها في جذر السن.
 
يُستخدم هذا العلاج لاستهداف المنطقة التي يقع الكيس فيها، حيث يؤدي ذلك إلى استخراج مكونات الكيس وبالتالي التخلص من المواد الضارة التي قد تؤذي أسنانك. أفضل ما في الأمر هو أن هذا الإجراء، في معظمه، هو إجراء غير جراحي ولا يتطلب أي عمليات قطع مكثفة.
 
قد تساعد الجراحة في العلاج عن طريق استئصال الكيس.
وهنالك بعض الحالات التي يجب فيها التخلص من السن، تلك التي تفشل فيها المعالجة اللبية والجراحة.
حيث يتم قلع السن بالكامل ثم تُنظف المنطقة التي كان يتواجد بها الكيس.
يضاف مزيج من العظم الاصطناعي إلى هذه المنطقة وهذا لتنظيف جميع آثار الكيس ومنعه من التكون مرة أخرى.''',
    ''' تخلخل الأسنان عادة ما يصاحبه ألمًا في الأسنان مع تورم في اللثة والتهابها ما يسبب التهابًا في الأنسجة الجرثومية فيتحرك السن من مكانه، فضلًا عن نزيف اللثة الناتج عن ورم الأنسجة المحيطة بها وامتلائها بالدم الذي يخرج بعد حدوث أي احتكاك بها كغسيل الأسنان بالفرشاة.
وفي هذه الحالة يجب استشارة طبيب الأسنان فورًا، وعمل فحوصات للتأكد من عدم وجود مرض عضوي يسبب تلك الخلخلة، وإذا وجد فيجب علاجه أولًا ثم البدء في علاج تلك الحالة، مع عمل تنظيف للأسنان وذلك عن طريق كحت الرواسب الجيرية.
 
أسباب تخلخل الأسنان
 
-أمراض دواعم السن واللثة، والتي قد تتسبب مع الوقت بإلحاق ضرر كبير بعظام الفكين والأسنان والأنسجة التي تربط السن باللثة.
-صديد وتقيح في منطقة ما من اللثة.
-مرض هشاشة العظام، والذي يسبب ضعفًا عامًا في مختلف عظام الجسم.
-الحمل، إذ قد تسبب التغيرات الهرمونية بتخلخل السن لفترة مؤقتة.
-أسباب أخرى، مثل: أورام العظام، وتعرض السن لحادث أو لإصابة ما، وتسوس الأسنان، وإهمال النظافة الفموية، ومرض السكري، وصريف الأسنان.
 
خلخلة الأسنان قد تكون مؤشرًا للإصابة بسرطان الفم، خاصة إذا صاحبها وجود قرح أو أورام تحت اللسان، مع خشونة في ملمس سقف الحلق، وتغيير في لون اللثة إلى لون أغمق يقترب إلى الأسود وعادة يكون سببها التدخين
 
لا يجب إهمال خلخلة الأسنان التي تؤدي في النهاية إلى تساقطها، فإن العظام الممسكة بالأسنان قد تتآكل وبالتالي تضعف فتترك الأسنان ويحدث ذلك بناءً على درجة الالتهاب أو درجة تآكل العظام.
 ''',
    '''الام الاسنان الصادرة من العاج
يظهر ألم الاسنان هذا بسبب عوامل خارجية، مثل المأكولات الباردة، الساخنة أو الحلوة. يتميز الم الاسنان بأنه قصير ويزول في اللحظة التي يزول فيها العامل الخارجي.
وتكون الام الاسنان متوسطة الحدّة ولا تتركز في نقطة معينة، حتى أن الشخص المصاب يجد صعوبة في تحديد مصدر الام الاسنان هذه، إن كان من الم الاسنان في الفك العلوي أم السفلي.
يرتبط سبب الام الاسنان، على الأغلب، بتسوس السن الذي يمكن ملاحظته من خلال النظر بالعين، مباشرة، أو عن طريق التصوير بالأشعة السينية.
ويشمل علاج تسوس الاسنان هذه تنظيف التسوس والحشو.
ويزول الم الاسنان مع إتمام العلاج.  
 
الام الاسنان الصادرة من لب السن
ألم الاسنان الصادر من لب السن هو الم اسنان ذاتي، نابع من مصدر داخلي، شديد جدا، يظهر بنوبات ويختفي بين النوبة والأخرى.
تدوم النوبة ما بين بضع دقائق وحتى ساعة كاملة.
تشتد الام الاسنان في هذا النوع من الام الاسنان عند تناول مأكولات باردة، أثناء المضغ أو في حال حدوث ضغط على السن المصابة.
هذا النوع من الم الاسنان يمكن أن يوقظ الشخص المصاب به من النوم.
من الصعب تحديد مصدر الألم، إذ قد يكون البرد هو المحفز الأساسي، لكن البرد ينتقل من سن إلى أخرى حتى يصل إلى الاسنان المصابة فيسبب الام اسنان شديدة.
سبب الم الاسنان: التهاب لب السن بعد نفاذ تلوث إلى اللب من تسوس الاسنان الحاد. يتمثل علاج تسوس الاسنان بمعالجة قناة الجذر واستئصال لب السن.
ويزول الم الاسنان، عادة، لدى إتمام العلاج.
 
الام الاسنان الصادرة من دواعم السن
الم الاسنان النابع من دواعم السن هو ألم ذاتي، نابع من مصدر داخلي، متواصل ويشتد أثناء المضغ.
مكان الألم محدد ويتركز في السن المصابة.
تتراوح شدة الام الاسنان بين المتوسطة والحادة ويكون مصحوبا، أحيانا، بشعور بأن السن مرتفعة في الفم وبانتفاخ في الوجه.
يمكن تحديد السن المصابة بواسطة النقر على الأسنان.
بكلمات أخرى: بواسطة تحديد السن الحساسة للنقر.
سبب الم الاسنان: تلوث نسيج الدواعم، الذي ينبع عادة من الفراغات التي في اللب وفي قنوات جذر (التهاب دواعم السن الذّرْويّ - Periapical periodontitis) أو من جيب عميق في اللثة (التهاب دواعم السن الجانبي - Lateral periodontitis).'''
  ];

  List<String> info2=[
    '''لكن الحقيقه أن هناك فرق بين تبييض الأسنان وتنظيف الأسنان وهو كالآتي :
 
dental scaling "تنظيف الاسنان"1)
 
هو إزالة طبقة الترسبات/البلاك والجير وبقايا الطعام من الأماكن على سطح السنه التي يصعب الوصول إليها بفرشاة الأسنان والخيط الطبي.
                  
tooth bleaching or tooth whitening "تبييض الاسنان"2)
 
هو تفتيح درجة لون الأسنان عن طريق استخدام أحماض قوية مثل
‏hydrogen peroxide أو ‏carbamide peroxide
على السنه ويقوم بعمل أكسده للسنه فيصبح لونها أفتح.''',
    '''سوف نشرح سبب ظهور الفراغات بعد إزالة الجير قبل معرفة إذا كان هذا صحيح أم خاطئ
الجير مثل أي مادة تشغل مكان وهذا يكون على حساب اللثه فـ مع الوقت يضعف العظام المحطية بالأسنان والتي تدعم الأسنان وتتراجع اللثه.
وبالتالي كلما زادت كمية الجير كلما ازدادت المشاكل.
 
الصح أن الجير يسبب مشاكل عديدة مثل أنه يضعف الأسنان و بالتالي يؤدي إلى تحركها في مكانها (اللخلخة) وتسوس الأسنان والتهابات اللثه، والنزيف الدائم بأقل ملامسه ليها
ومع الوقت تصاب الأسنان بتصبغات ويتغير لونها للون غير مرغوب به
وطبعاً بالاضافه للرائحه الكريهه جدا للفم، حتي مع غسيل الأسنان بالفرشاة.''',
    '''وهذا اعتقاد خاطئ؛ لأن تنضيف الـترسبات/البلاك
لا يختلف سواء فرشاة ناعمة أو متوسطة أو خشنة 
المشكلة أنه يحدث تآكل للثه وتدمر وتزيد قابلية الأسنان للتسوس، وبالتالي سوف تزداد الحساسية وأيضاً سوف تؤثر على المظهر الجمالي.''',
    '''الحقيقه أن ضرس العقل ليس له أي علاقة بالرشد أو العقل بالإضافة لأنه يعد أكثر الاسنان عرضه لعدم الظهور ... هل يعني ذلك بأنك بلا عقل!
بالطبع لا ... تم تسميته بضرس العقل لأنه آخر الأسنان الدائمه التي تظهر بفم الانسان ويظهر في سن متأخر تقريبا من (١٨ : ٢٥) وهذه هى فترة النضج و الاتزان في التفكير ومن هنا تم تسميته بضرس العقل.
''',
    '''لا تقلق فـ العديد من الناس يخلطون بين غاز الفلور السام والفلورايد المفيد للجسم والموجود في الشاي الأخضر والأسماك والمياه المعدنيه.
هل تعلم أن 0.25 جرام من البازلاء يحتوي على 0.125 من الفلورايد وأن معجون الأسنان المخصص للبالغين يحتوي 1450 جزء من المليون من الفلورايد وهذه تعد نسبة قليلة جدا غير مضره بالجسم.''',
    '''والصح أن استخدام الليمون لتبيض الأسنان يدمر طبقة المينا
وهي الطبقة الصلبة الخارجية الحاميه للسن من العوامل الخارجية التي تؤدي إلى تسوس السن كما أن الأحماض الموجوده في الليمون تؤدي لحدوث حساسية الاسنان كما يؤدي لاصفرار الاسنان ليس تبيضها.''',
    '''إنه اعتقاد خاطئ، العديد من الآباء والأمهات لا يدركون أنه يجب على الأطفال زيارة طبيب الأسنان، بمجرد أن تبدأ أسنانهم الأولى في الظهور.''',
    '''لسوء الحظ، لا توقف جميع أنواع أطعمة النعناع في العالم رائحة الفم الكريهة.
ويعد امتصاص النعناع من خلال مضغ العلكة، حلا جيدا على المدى القصير، ولكن في حال احتوت العلكة على السكر، فقد يؤدي ذلك إلى تفاقم الوضع على المدى البعيد''',
    '''ولكن غسيل الأسنان كثيرًا غير مستحب لأنه يؤدي لتآكل المينا، وغيرها من الأمراض نتيجة كثرة استخدام المعجون، فمن الأفضل استخدام غسول الأسنان بين الليل والنهار، بدلًا من غسلها أكثر من مرتين، وهو العدد المناسب لغسيل الأسنان.''',
    '''ولكن غسيل الأسنان كثيرًا غير مستحب لأنه يؤدي لتآكل المينا، وغيرها من الأمراض نتيجة كثرة استخدام المعجون، فمن الأفضل استخدام غسول الأسنان بين الليل والنهار، بدلًا من غسلها أكثر من مرتين، وهو العدد المناسب لغسيل الأسنان.''',
    '''الحقيقة- عندما يكون الألم قوي لدرجة انه لا يوجد خيار اخر فهذه علامة على ان السن في حالة سيئة للغاية.
هذه الحالة عادة ما تتطلب علاج الأسنان المعقد والمكلف والذي يشمل علاج قناة الجذر وتثبيت التاج.
لذا عند التوجه للفحص كل ستة أشهر على النحو الموصى به يمكن رؤية المشكلة في بدايتها والعلاج يكون سهل وبسيط وسريع أكثر.
أما الشخص الذي لا يأتي الى الطبيب إلا عندما يكون هناك ألم، يقوم بتبذير ماله ووقته.''',
    '''الحقيقة- الشعور بالألم بعد علاج قناة الجذر هو أمر شائع ويحدث لدى نحو 50٪ ممن يعالجون لدى طبيب الأسنان.
لطبيب الأسنان تأثير ضئيل جدا على الشعور بالألم بعد العلاج، فالألم بعد العلاج أكثر شيوعا في حالات تجديد علاج قناة الجذر نتيجة لتطور الالتهاب في قمة الجذر.
في هذه الحالات قد يشعر بالتورم بعد العلاج.''',
    '''الحقيقة- لا توجد قاعدة في طب الأسنان التي تنص على أنه يجب خاع ضرس العقل لمجرد كونه ضرس عقل، تنبت ضروس العقل في أغلب الأحيان بشكل لا يسمح لها بالاندماج بأسنان الفم، إذ أن نموها بشكل غير صحيح يمكن أن يسبب الالتهابات المتكررة والضرر في الضروس الأمامية.
طبيب الأسنان فقط يمكنه تحديد ما إذا كانت هناك حاجة حقيقية لقلع ضرس العقل.''',
    '''الحقيقة- كثير من الناس يمتنعون عن تنظيف الأسنان، عندما يكون هناك نزيف في اللثة، النزيف يحدث نتيجة لالتهاب اللثة، الذي سببه سوء النظافة بينما التنظيف المنتظم يقلل ويساعد حتى في وقف النزيف، وإذا لزم الأمر، يوصى بإجراء تنظيف لدى طبيب الأسنان.''',
    '''الحقيقة- خلال الثلث الأول من الحمل فان خلايا الجنين تكون حساسة جدا للإشعاع، لذلك فالصور الغير ضرورية ينصح بتأجيلها حتى نهاية الثلث الأول من الحمل، مع ذلك إذا كان علاج الأسنان ملح، وهناك حاجة لإجراء التصوير لدى طبيب الأسنان لإجراء العلاج بشكل صحيح وكامل، فيوصى بإجراء الصور اللازمة وذلك من أجل تلقي العلاج الصحيح والدقيق والذي عادة لا يكون ممكن من دون تصوير الأشعة السينية.''',
    '''الحقيقة- أثناء الحمل تحدث تغيرات هرمونية في الجسم التي تسبب لتورم اللثة والشعور بالتهابها، بسبب ذلك عدد كبير من النساء يتوقفن عن الحفاظ على نظافة الفم وعن زيارات المتابعة لدى طبيب الأسنان وعن العلاجات المطلوبة.
تحديدا خلال فترة الحمل، من المهم الحرص على نظافة الفم، والاستمرار في الزيارات المنتظمة والعلاجات المهمة لدى طبيب الأسنان.''',
    '''لحقيقة- الترميم (الحشوات) التي تخرج من السن نتيجة لمضغ العلكة ببساطة لم تنفذ بشكل دقيق.
فالعلكة ليست ضارة بل على العكس مفيدة لحالة الفم والأسنان.'''
  ];

  List<String> info3=[
    '''تهدف عملية خلع الاسنان عادة اٍلى اٍخراج السن المصابة من مكانها بشكل كامل، عقب التلف التدريجي الذي أصاب طبقات السن – المينا، العاج ولب السن بما في ذلك قنوات الجذر.
يحدث تلف الأسنان غالبا كنتيجة لكثرة التسوس – تراكم لويحات (plaque) جرثومية.
 
عندما يعبر التسوس طبقات السن الخارجية ويصل اٍلى لب السن – وهي الطبقة الداخلية التي تحتوي على أعصاب وأوعية دموية، فاٍن الطريقة الوحيدة لعلاجها، قبل حدوث اٍلتهاب واٍصابة مزمنة لطبقة العظم، هي بواسطة علاج قناة الجذر.في حال فشل علاج قناة الجذر، فاٍنه لا توجد اٍمكانية لاٍنقاذ السن المصاب، حيث يجب اٍخراجه من الفم قبل أن يؤدي اٍلى اٍلتهاب وعدوى موضعية، التي يمكن أن تؤدي اٍلى آلام كثيرة واٍنتشار العدوى.
 
في حالات معينة، هنالك حاجة لقلع ضرس العقل البارز أو المخفي، لمنع اٍصابة الأسنان المجاورة عقب الضغط الموضعي الذي يحدثه الاحتكاك وإزاحة الأسنان المجاورة.
 
يتم القيام بقلع السن أحيانا في أمراض اللثة الشديدة الي تؤثر سلباً على الأنسجة الداعمة للسن ومحيطه.
 
يمكن االقيام بقلع السن بطريقة يدوية بسيطة (بواسطة كماشة) أو بطريقة جراحية عن طريق اٍحداث شق في اللثة.
 
قبل الخلع:
 
غالبا ما يتم اٍجراء قلع السن تحت تأثير التخدير الموضعي فقط، رغم الاٍمكانية، في هذه الأيام، للقيام به تحت تأثير التخدير العام.
 
غالبا ما تكون حاجة لتصوير الأسنان بالأشعة السينية قبل القيام بالقلع، وأحيانا تكون هنالك حاجة للقيام بتصوير خاص (بانورامي)، أو حتى فحص التصوير المقطعي المحوسب (CT)، وذلك من أجل تشخيص مرض السن بشكل دقيق، والتأكد بشكل نهائي من عدم توفر اٍمكانية أخرى لاٍنقاذ السن.
 
عادة لا توجد حاجة للقيام بتحضيرات أخرى خاصة قبل القيام بالقلع.
أما الأشخاص المعرضون بشكل كبير للاٍصابة باٍلتهاب صمامات القلب (اٍلتهاب الشغاف - Endocarditis)، كالأشخاص ذوو الصمامات القلبية الاٍصطناعية، الأشخاص الذين قاموا بزرع للقلب وغيرهم، فاٍنه يجب عليهم اٍعلام طبيب الأسنان بذلك من أجل تناول المضادات حيوية قبل القيام بقلع السن.
 
يجب على الأشخاص الذين يعانون من اضطرابات في تخثر الدم أن يقوموا باٍجراء فحوصات لتخثر الدم، قبل العلاج  لتجنب حدوث نزيف.
 
الخطوات:
 
يتم اٍجراء قلع السن في عيادة الأسنان وبظروف معقمة على يد طبيب الأسنان.
يتم القيام بالقلع الجراحي على يد طبيب أسنان مختص في جراحة الفم والفك.
 
يتم حقن المريض بحقنة تخديرية موضعية في المنطقة المطلوبة، بشكل مماثل لعلاج الأسنان الطبيعي (تكون هنالك حاجة أحيانا لتوسيع المنطقة المخدرة).
يستخدم الطبيب الكماشات السنية (dental) للقيام بالقلع البسيط، بواسطة الإمساك بطرف السن الظاهر للعين وأرجحته حتى يتحرك ومن ثم يتم اٍقتلاعه من مكانه.
بعد قلع السن يقوم الطبيب باحداث ضغط موضعي بطيء على الأنسجة من أجل إيقاف النزيف.
 
أما قلع السن الجراحي، فيتم اٍجراؤه بواسطة اٍحداث شق في اللثة أسفل السن واٍخراج السن مع الأنسجة الداعمة التي تحيط به.
بعد ذلك يتم قطب الشق بواسطة قطوب تمتص بشكل ذاتي.
 
يستغرق قلع السن ما يقارب ال 30 دقيقة.''',
    '''يهدف علاج قناة الجذر (جذر الأسنان) لعلاج الأسنان المتضررة، عقب تآكل طبقات هذا السن بشكل تدريجي- المينا، العاج واللب.
في معظم الحالات يتآكل السن نتيجة لكثرة التسوس - تراكم لويحة جرثومية.
 
عندما يخترق التسوس طبقات السن الخارجية ويصل إلى اللب- وهي الطبقة الداخلية التي تحوي الأعصاب والأوعية الدموية، فإن الطريقة الوحيدة لعلاج هذه الحالة قبل التهاب السن وتضرر الأنسجة العظمية في السن بشكل دائم, هي عن طريق علاج قناة جذر السن: فتح السن، إزالة التسوس، إزالة اللب وتنظيف قناة الجذر، وفي النهاية يجب ملأ السن بمادة خاصة تقوم بسده.
إمكانية العلاج الثانية تكمن بقلع السن.
الأعراض التي قد تشير لتضرر السن تشمل الألم، تورم الوجه أو العنق، ثقب في السن، الحساسية من البرد أو الحرارة، وتورم دواعم السن وغيرها.
 
قبل العلاج:
 
في معظم الحالات يتم علاج قناة جذر السن تحت تأثير التخدير الموضعي فقط، بالرغم من أنه يمكن القيام بهذه الجراحة تحت تأثير التخدير العام.
وفي بعض الأحيان يمكن القيام بهذا العلاج من دون اللجوء لتخدير المريض بالمرة، هذا في حال فقد السن حيويته (نتيجة لتضرر الأعصاب لا يكون هنالك شعور بالألم أو أي شعور أخر).
 
قبل القيام بالعلاج يجب القيام بتصوير الأسنان بواسطة الأشعة السينية (X-ray) وفي بعض الحالات يتطلب الأمر القيام بصورة خاصة (صورة بانورامية) من أجل تحديد مرض السن بشكل دقيق.
لدى الأشخاص الذين يتمتعون بصحة جيدة لا داعي لإجراء فحوصات أخرى خاصة. ولكن المرضى الذين يعتبرون أكثر عُرضة للإصابة بالتهاب الشغاف (Endocarditis) كالأشخاص ذوي الصمامات الاصطناعية وغيرهم، يتحتم عليهم إعلام طبيب الأسنان حتى يزودهم بجرعة من المضادات الحيوية قبل القيام بالعلاج.
قد يُطلب من الأشخاص الذين يعانون من اضطرابات في تخثر الدم، إجراء فحص دم لفحص وظائف التخثر لديهم قبل العملية الجراحية، ذلك أنهم عرضة للإصابة بالنزيف.
 
الخطوات:
 
يتم القيام بهذا العلاج في عيادة الأسنان بظروف معقمة، في بعض الأحيان يستمر العلاج لأكثر من لقاء واحد بل العديد من اللقاءات العلاجية في العيادة.
 
يتم حقن المريض بمادة مخدرة موضعية للمنطقة المنوي معالجتها، كما هو الحال في كل علاجات الأسنان الإعتيادية (في بعض الأحيان تكون هنالك حاجة لتوسيع نطاق التخدير).
المرحلة الأولية من العلاج تشمل القيام بفتح المينا وإزالة التسوس المتراكم في السن ومن حوله، عن طريق أدوات خاصة بعد ذلك تتم إزالة طبقة لب السن، ويتم تنظيف قناة جذر السن بشكل شامل.
 
في حال كان من الممكن إنهاء العلاج بجلسة علاجية واحدة يقوم الطبيب بإدخال مادة خاصة تقوم بسد قناة جذر السن، والتي تهدف لمنع تكاثر جراثيم جديدة في منطقة جذر السن.
من ثم, يقوم الطبيب بسد السن بشكل عادي (حشو).
في الحالات التي يقرر فيها الطبيب تقسيم العلاج على عدة جلسات (مثلا بسبب الانتظار حتى شفاء الالتهاب القائم في موقع العلاج)، سيقوم الطبيب بملأ قناة السن بمادة معقمة وبحشو السن بمادة مؤقتة، ويتم سد السن بشكل دائم في مرحلة متقدمة. تستغرق كل جلسة نحو ساعة.''',
    '''يهدف حشو تجويف الأسنان (Cavity) لإصلاح الأسنان التالفة، التي أصيبت بالضرر نتيجة التآكل التدريجي في طبقات الأسنان الخارجية – المينا، العاج.
يحصل تلف الأسنان بالعادة نتيجة للتسوّس - أي تراكم طبقة جرثومية، بسبب انخفاض مستوى النظافة الصحية في الفم.
 
عندما يخترق التسوس نسيج الأسنان الخارجي، يكون من المستحسن علاجه قبل حدوث التهاب وضرر دائم في نسيج اللب (الأنسجة التي تحتوي على جذور الأعصاب والأوعية الدموية)، أو تكسر الأسنان.
 
يطلق على هذا العلاج الوقائي اسم "حشو الأسنان".
وهو يتضمن: فتح السن، إزالة التسوس، إزالة أنسجة الأسنان التالفة، وحفر السن بشكل يتيح حشوه صناعيًا.
أما المرحلة الأخيرة، فتشمل ملء السن بمادة خاصة.
 
تشمل علامات تلف طبقات الأسنان الخارجية ما يلي: ألم الاسنان أو حساسية مفرطة للحرارة أو البرد.
في الحالات الأشد، وعندما يكون هنالك التهاب نشط أو إصابة في العصب، من الممكن أن يحصل تورم في اللثة أو الرقبة.
 
أحيانا، يتم استخدام حشو الأسنان من أجل إصلاح الأسنان المتصدعة أو البالية، وليس فقط لعلاج تراكم اللويحة الجرثومية (البلاك).
تسمى هذه العملية "عملية ترميم الأسنان".
 
قبل العلاج:
 
بالغالب، يتم إجراء عملية حشو الأسنان تحت التخدير الموضعي، لكن من الوارد أيضا أن يتم إجراؤها تحت التخدير الكامل.
قبل حشو الأسنان، يطلب الطبيب عادة من المريض إجراء تصوير بالأشعة السينية للأسنان، أو تصوير خاص (صورة بانورامية)، من أجل تشخيص مرض الأسنان بشكل دقيق (وذلك للتحقق مما إذا كان هنالك مرض في الأسنان أشد حدة من الظاهر للعيان، وهو ما يتطلب نوعا مختلفا من العلاج، على سبيل المثال: علاج عصب استباقي).
 
بشكل عام، لا يحتاج الأشخاص الأصحاء لاتخاذ خطوات تحضيرية إضافية خاصة.
لكن على الأشخاص المعرضين لخطر الإصابة بالتهابات صمامات القلب (التهاب الشغاف)، كما هو الحال بالنسبة لأصحاب الصمامات الصناعية، والمرضى الذين خضعوا لزرع قلب، وما إلى ذلك، إبلاغ طبيب الأسنان من أجل الحصول على المضادات الحيوية قبل العملية.
 
الخطوات:
 
يتم إجراء حشو الأسنان في عيادة الأسنان في ظروف من التعقيم الكامل، ويقوم بإجراء هذا الحشو طبيب أسنان.
في بعض الأحيان، تستغرق عملية الحشو أكثر من جلسة واحدة، وذلك في حال وجود عدد من الأسنان التي تحتاج للعلاج.
 
أولاَ يتم تخدير المكان موضعيا، وهو ما يمكن أن يسبب بعض الألم.
تشمل المرحلة الأولى من العلاج فتح مينا السن وإزالة التسوس الذي تراكم فيه وحوله، وذلك بواسطة أدوات خاصة.
بعد ذلك تتم إزالة أنسجة الأسنان التالفة (عادة بسبب التحلل) بشكل جذري.
 
بهذه الطريقة، يكون الطبيب قد جهّز التجويف في السن، لكي يستطيع حشوه بمادة خاصة.
يتم هذا التحضير من خلال حفر طبقات السن وتشكيل مبنى السن الداخلي بشكل يسمح بتعبئته.
 
بعد هذا، يضع الطبيب مادة الحشوة.
يتم إدخال طبقات الحشو ببطء، من أجل إتاحة الفرصة أمام كل طبقة لأن تجف وتنغلق بأفضل صورة.
 
في المرحلة الأخيرة من الإجراء، يشكل طبيب الأسنان بقايا المادة، بحيث يعود شكل السن وأداؤه إلى الحالة الطبيعية التي كانت قبل تنفيذ الحشو (قدر الإمكان).
يستغرق هذا الأجراء مدة تتراوح بين عشرين دقيقة حتى نصف ساعة لكل سن.''',
    '''الهدف من تلبيس الأسنان هو إنشاء بنية واقية للحفاظ على الأسنان التالفة نتيجة صدع / كسر في بنية السن، أو الأسنان التي خضعت لعلاجات مركبة لإعادة بنائها، على سبيل المثال بعد علاج قناة جذر الأسنان، زراعة الأسنان وغيرها.
 
تساعد تيجان الأسنان على استعادة بنية أو هيكل الأسنان بعد العلاج، وذلك بواسطة وضع مبنى يحمي الأسنان من التسوس، يمنع كسر الاسنان في المستقبل أو إصابة السن بالعدوى مرة أخرى، إذ أن جميع هذه الامور كفيلة بأن تؤدي إلى فقدان الأسنان.
 
أحيانا يتم وضع تاج على سن مصاب بتلف متقدم، ولم يتبقى الكثير منه، بغرض محاولة تصليحه لاحقاً، كبديل عن قلع السن.
في الحالات التي يكون هناك جسر على عدد من الأسنان، تتم الإستعانة أحياناً بتاج السن لتثبيت الجسر في مكانه.
 
هيكل التاج مصنوع من مادة صلبة، تتم ملاءمتها لبنية السن المصاب، عن طريق تحولها من الحالة السائلة الى الحالة الصلبة.
يتيح إستخدام التاج الأبيض إصلاح السن من الناحية الطبية ومن الناحية الجمالية أيضاً.
 
التحضير:
 
علاجات تيجان الأسنان يتم عادة تحت تأثير التخدير الموضعي فقط، على الرغم من أن اليوم يمكن إجراء هذا العلاج حتى تحت تأثير التخدير العام.
 
قبل البدء بعلاج تيجان الأسنان عادة يطلب إجراء صورة بالأشعة السينية للأسنان، وأحياناَ قد يلزم تصوير خاص (صورة بانورامية)، من أجل تشخيص مرض السن بدقة، والتأكد من إجراء جميع العلاجات الضرورية من الناحية الطبية (مثل علاج قناة جذر الأسنان).
 
بالإضافة إلى ذلك، هناك حاجة لاخذ قوالب، أي صب هيكل الفك العلوي والسفلي، من مادة إصطناعية تتصلب، مما يخلق نموذجا لهيكل السن، لأخذ المقاسات بغرض الترميم. يتم أخذ القوالب خلال العلاج الذي يسبق العلاج الأول الذي يوضع به التاج.
 
عند الأشخاص الأصحاء عادة لا حاجة لتحضيرات اضافية خاصة. الأشخاص الذين يعتبرون عُرضة للإصابة بإلتهابات في صمامات القلب (التهاب الشغاف - Endocarditis)، كالذين يملكون صمامات اصطناعية، وما شابه، عليهم إبلاغ طبيب الأسنان من أجل الحصول على المضادات الحيوية قبل تلقي أي علاج.
 
يطلب من الناس الذين لديهم تاريخ طبي يشمل اضطرابات في تخثر الدم، إجراء فحوصات لتخثر الدم قبل أجراء علاج تلبيس الأسنان، لأنهم معرضون لخطر النزيف.
 
الخطوات:
 
يقوم طبيب الأسنان بعلاج تيجان الأسنان في عيادة الأسنان في ظروف معقمة.
 
في بعض الأحيان يستمر العلاج لأكثر من جلسة واحدة، وحتى لعدة جلسات في العيادة.
 
يتلقى المريض تخديراً موضعياً للمنطقة المطلوبة، كما هو الحال في علاج الأسنان الإعتيادي (وأحيانا من الضروري توسيع نطاق التخدير).
الخطوة الأولى في العلاج، تشمل فتح مينا السن وإزالة التسوس الذي تراكم في السن وحوله، بواسطة معدات خاصة.
 
يحفر الطبيب السن لتغيير شكله حتى يتمكن من استيعاب هيكل التاج بالقدر الأمثل. عادة، في الجلسة الثانية يكون هناك شكل أولي للبنية القائمة، ويقوم الطبيب بإجراء تغييرات حسب الحاجة.
أحياناً يلزم الأمر إعادة أخذ القوالب.
 
أثناء تركيب هيكل السن، قد يتطلب العلاج القيام بالقص وإدراج خيوط في دواعم السن التي تحيط بالسن، لإخراج المزيد من الأنسجة لوضع الهيكل في جانبي السن.
 
في بعض الحالات يلزم أيضا تمديد تاج السن أو حفر السن المقابل من أعلى أو من أسفل للمساعدة بإغلاق الفكين بطريقة جيدة، دون أن يسبب الهيكل الجديد الإزعاج أو الشعور بعدم الراحة.
في نهاية العلاج يستخدم الطبيب مادة لاصقة، يلصق بها التاج المؤقت على االسن، حتى الجلسة المقبلة.
في هذه الفترة بين الجلسات، يعطي الطبيب القياسات الجديدة للمختبر، حتى إتمام التاج وتثبيته.
عادة ما يتطلب الأمر عدة جلسات لإنشاء تاج متوافق.
مدة كل جلسة نصف ساعة.''',
    '''تهدف زراعة الاسنان إلى غرس زرعات (Implants) معدنية جديدة مكان الأسنان، عن طريق استبدال الأسنان التالفة أو المعطوبة، أو لتعويض الأسنان المفقودة، وذلك نتيجة لأمراض تتسبب في تلف الأسنان المتقدم.
 
قد ينجم تلف وعطب الأسنان عن الإصابة بعدوى جرثومية مزمنة، في الأنسجة المحيطة بالسن (المسؤولة عن توفير الدعم للسن)، أولاً عن طريق تكون لويحة جرثومية على الأسنان، ولاحقاً عن طريق التسبب بحدوث إلتهاب بالأنسجة المحيطة.
 
يتم تثبيت الزرعات في الفك، وتستخدم لخلق قاعدة قوية لبناء هيكل فوق السن عن طريق وضع تاج، أو مبنى بديل آخر للسن من أجل إعادة بناء تجويف الفم.
 
يفضل في بعض الأحيان زراعة الاسنان الثابتة بدل القيام بعلاجات أخرى للإصلاح وإعادة البناء مثل الجسر أو علاج جذر العصب، التي تسبب إزعاجاً كبيراً للمريض والتي لا تكون ناجحة دائماً.
ومن ناحية اخرى، فإن علاج زراعة الأسنان ليس بالعلاج السهل، كما أنه مكلف، ويسبب الشعور بالكثير من الألم وعدم الراحة.
الميزة الرئيسية للعلاج هو أنه يوفر بديلا دائماَ وجيداَ للأسنان لسنوات عديدة.
 
التحضير لجراحة زراعة الاسنان:
 
تتم معظم عمليات زراعة الأسنان تحت تأثير التخدير الموضعي فقط، على الرغم من أنه يمكن أيضا أن يتم إجراء زرع الأسنان تحت تأثير التخدير العام.
 
قبل زراعة الأسنان ، يُطلب من المريض إجراء فحص تصوير للأسنان، وعادة يًطلب إجراء صورة خاصة (صورة أشعة بانوراما للأسنان) أو حتى فحص التصوير المقطعي المحوسب (CT)، للكشف والتشخيص عن حالات الأسنان التي ليس بالإمكان رؤيتها من خلال الفحص الإعتيادي.
 
لدى الاشخاص الذين يتمتعون بصحة جيدة لا توجد حاجة للقيام بتحضيرات خاصة. بينما الأشخاص الذين يكونون عُرضة للإصابة بإلتهاب الشغاف (Endocarditis)، كالأشخاص ذوي الصمامات الاصطناعية، منقوصي المناعة (Immunocompromised) وغيرهم، يجب عليهم إعلام الجراح بذلك، من أجل تلقي مضادات حيوية قبل إجراء زراعة الأسنان.
 
يُطلب من الأشخاص الذين يعانون من إضطرابات في تخثر الدم، إجراء فحوصات لوظائف تخثر الدم قبل العملية، لأنهم أكثر عُرضة للإصابة بنزيف.
 
إضافة إلى ذلك، من أجل الحصول على أفضل النتائج من الناحية التجميلية، عادة يلزم القيام بسلسلة من الاختبارات الأولية، لإنشاء مبنى سن ذو لون ملمس مشابه قدر الإمكان للأسنان الأصلية.
 
في الحالات التي تكون فيها أنسجة عظم الفك غير مناسبة لتقبل الغرسات، يجب القيام بعلاجات مسبقة لعدة أشهر قبل زراعة الأسنان لإنشاء منطقة مناسبة في الانسجة لتلقي الغرس (تركيب العظام).
 
مجرى عملية زراعة الاسنان:
 
يتم إجراء جراحة الأسنان في العيادة تحت ظروف معقمة، من قبل طبيب أسنان متخصص في زراعة الأسنان و / أو جراحة الفم والفك.
يتم تخدير المريض بواسطة حقنه بمخدر موضعي في منطقة دواعم السن، كما هو الحال في علاجات الأسنان العادية (في بعض الأحيان هناك حاجة بتوسيع نطاق التخدير، وفقاً لموقع الغرسات).
 
إذا كان العظم على استعداد لتلقي الزرع (أحياناً بعد سلسلة علاجات مسبقة)، يمكن البدء بعملية زرع الأسنان.
يتم تثبيت المسامير المعدنية اللولبيه براغي، بعظم الفك.
 
في سلسلة أخرى من العلاجات بعد فترة من إدخال البراغي، تبدأ عمليات إعادة البناء عن طريق أخذ القياسات وإنشاء التاج / الجسر.
عندما يدور الحديث عن فترة الانتظار بين تركيب الغرسات وبين تنفيذ الاستبناء النهائي، فإن هنالك أكثر من نهج واحد.
النهج المتبع غالباً هو الإنتظار لمدة 6 أسابيع على الأقل حتى تلتئم الأنسجة، وأحياناً تصل فترة الإنتظار لعدة شهور.''',
    '''يعد تبيض الأسنان واحداً من العلاجات التجميلية الأكثر شعبية للأسنان، لأنه يستطيع أن يحسن بشكل كبير من مظهرها.
 
تسمى الطبقة الخارجية للسن المينا.
تتكون كل يوم على المينا طبقة رقيقة تقوم بامتصاص البقع.
في مينا الأسنان توجد ثقوب تستطيع إستيعاب البقع.
لا يعتبر تبييض الأسنان علاجاً يكفي أن يتم إجراؤه مرة واحدة، إذ ولكي يدوم اللون الفاتح، يجب تكرار العلاج من وقت لآخر.
 
التحضير للعلاج:
 
قبل علاج تبييض الأسنان يجب علاج تسوس الأسنان، وذلك لأن المحلول المبيض يمكن أن يصل عبر المناطق التالفة إلى الأجزاء الداخلية من الأسنان.
 
في مثل هذه الحالات، يمكن أن تصبح الأسنان حساسة.
 
فتبييض الأسنان ليس فعالاً للأسنان التي تكون جذورها مكشوفةً، والتي ليس لديها طبقة المينا.
يؤدي تراجع دواعم السن (اللثة) أحيانا لكشف جذور الأسنان.
كذلك، فإن تبييض الأسنان ليس فعالاً في حالات الحشوة القديمة، التيجان، أو الكسوة الخزفية.
 
ليس بوسع المادة المبيضة إختراق الترسبات التي تتجمع على السن، لذلك، لكي ننجح في الوصول إلى السطح الخارجي للسن، من المهم أن يقوم طبيب الأسنان أو اختصاصي حفظ صحة الأسنان بتنظيف الأسنان قبل علاج التبييض.
بعد تنظيف الأسنان يمكن أن يتم البدء بعلاج التبييض.
 
تستخدم عيادات الأسنان إحدى الطرق الأكثر تحكماً والأكثر منفعة من ناحية التكلفة مقابل الفائدة المتوفرة حالياً.
يقوم اختصاصي حفظ صحة الأسنان بتحضير قوالب للمريض تحتوي على جل (هلام) مبيّض، يتناسب تماماً مع أسنانه.
يستغرق التبييض المنزلي مدة أسبوعين حتى ثلاثة أسابيع.
 
يمكن عمل تبييض للأسنان في المنزل عن طريق الإستعانة بقوالب، تُباع بدون وصفة طبية ومنتشرة في أماكن عديدة.
مستوى ملاءمة هذه القوالب التي تباع بهذه الطريقة منخفضة، كما أنها ليست سهلة الاستخدام وقد تصل المادة المبيضة إلى دواعم السن.خطر إلحاق الضرر بالأسنان نتيجة لاستخدام هذه القوالب هو أكثر بكثير وبالتالي يوصى بعدم استخدامها.
 
عملية العلاج:
 
هناك نوعان رئيسيان من علاجات تبييض الأسنان.
تبييض سن واحد، الذي تم علاج قناة جذره ولم يعد فيه عصب حي، وتبييض الأسنان التي لا تزال فيها الأعصاب حية.
 
١-تبييض الأسنان التي لم يعد فيها عصب حي:
 
في بعض الحالات، لا يستطيع تبييض الأسنان العادي تحسين مظهر الأسنان، التي تم علاج قناة الجذر فيها.
في مثل هذه الحالات يقوم طبيب الأسنان بإجراء علاج مختلف، يبيّض السن من الداخل، من ثم يضع مادة مبيضة داخل السن ويغطيها بمادة حشو مؤقتة.
يبقى السن في هذه الحالة لعدة أيام.
أحياناً، من أجل الحصول على اللون المطلوب، من الضروري تكرار العلاج لعدة مرات.
 
٢-تبييض الأسنان التي لا تزال فيها الأعصاب حية:
 
في حالة تبييض الأسنان المنزلي، بأخذ طبيب الأسنان عينات من بصمة أسنان المعالج ويحضر له قالباً واحداً أو إثنين ، يطابق تماماً مبنى فمه وأسنانه.
إذا كان المريض معنياً بتبييض صف واحد فقط من الأسنان (العلوي فقط أو السفلي فقط) يحضر طبيب الأسنان قالباً واحداً فقط، عند تبييض الصفين معاً، يحضر الطبيب قالبين.
 
من المهم جداً، أن يطابق قالب بشكل دقيق مبنى فم المريض.
يساهم التطابق الجيد في إبقاء المادة المبيضة على الأسنان، بحيث لا يسبب تهيج دواعم السن (اللثة).
لا تتناسب القوالب، التي تباع بدون وصفة طبية، عادةً تماماً مع هيكل الفم.
إذا تمكنت المادة المبيضة من التسرب، قد تسبب تهيج دواعم السن.
 
في البيت يتم ملء كل واحد من القوالب بالمادة المبيضة، التي يتم الحصول عليها من الطبيب.
من ثم يتم تركيب القالب في الفم لعدة ساعات كل يوم.
يصل الكثير من الأشخاص إلى مستوى التبييض المطلوب، خلال أسبوع أو أسبوعين. ولكن في بعض الحالات، هناك حاجة لتركيب قالب لمدة أربعة أسابيع أو أكثر.''',
    '''كسوة الأسنان الخزفية (Veneer) عبارة عن قشرة دقيقة مصنوعة من مادة الخزف (Porcelain) أو من حشوة الراتين (Resin)، والتي توضع في مقدمة الأسنان.
لا يحتاج القيام بهذا الإجراء للتخدير، وإذا لزم الأمر، يتم إجراؤه تحت تأثير التخدير الموضعي فقط.
تشكّل الكسوة الخزفية (Veneer) حلاً ممتازاً لتحسين مظهر الأسنان الأمامية.
تستخدم الكسوة الخزفية (Veneer) بهدف إخفاء التغييرات التي تطرأ على لون الأسنان، من أجل تفتيح لون الأسنان ولتحسين مظهر الابتسامة.
 
 
لماذا يتم اللجوء لهذا العلاج؟
 
في معظم الحالات، تعتبر كسوة الأسنان بديلاً ممتازاً لتيجان (Crowns) الأسنان.
تتيح كسوة الأسنان الخزفية إتباع نهج محافظ أكثر لتغيير لون الأسنان، تغيير حجم أو شكل الأسنان.
كما أن كسوة الأسنان الخزفية تخفي العيوب غير المرغوب بها في الأسنان، كالأسنان الملطخة بالتتراسيكلين (Tetracycline)، والعيوب الناتجة عن الإصابة أو عن علاج جذر الأسنان.
 
إضافةً إلى ذلك، فهي ممتازة في تغطية الحشوات التي بَهُتَ لونها، في الأسنان الأمامية.
بإمكان المرضى الذين توجد لديهم فجوات بين أسنانهم الأمامية، أو أسنانهم مكسورة أو مهترئة، أن يلجؤوا إلى كسوة الأسنان.
تدوم كسوة الأسنان الخزفية عادةً لسنوات عديدة، فلقد أثبتت هذه الطريقة نفسها، إذ أنها تدوم لفترة طويلة جداً، إذا تم تطبيقها وتنفيذها بمهنية.
 
مراحل العلاج:
 
يحتاج إتمام علاج كسوة الأسنان، لثلاث جلسات علاجية، تتخلّل: تحديد التشخيص، تخطيط العلاج، التحضير للعلاج واللصق.
من الضروري أن تكون شريكا فعالا في تخطيط وتصميم إبتسامتك الجديدة.
كرس وقتاً لتخطيط إبتسامتك الجديدة.
عليك أن تفهم تقييدات وقدرات هذا الإجراء على الإصلاح.
إذا لزم الأمر، توجه إلى إستشارة أكثر من طبيب أسنان، من أجل أن تشعر بالأمان، ولتوضح لطبيب الأسنان الأهداف والغايات التي تطمح لتحقيقها من خلال هذا العلاج.
من أجل تحضير أسنانك للكسوة الخزفية (Veneer)، يتم برد أسنانك بشكل ناعم، كي تتمكن من إستيعاب طبقة الكسوة الرقيقة بشكل أفضل.
 
عادة يتم برد حوالي نصف ميلمتر من طبقة السن، وقد يتم إجراء هذه العملية تحت تأثير التخدير الموضعي.
يتم تركيب الكسوة المصنوعة من حشوة الراتين عادةً خلال زيارة واحدة لعيادة الأسنان. بعد تحضير السن للعملية، يضع طبيب الأسنان طبقة الكسوة بعناية وينحتها بالشكل المطلوب.  
 
عندما يدور الحديث عن كسوة الأسنان الخزفية (البورسيلان)، يتم أخذ بصمة للأسنان، والتي يتم إرسالها بعد ذلك إلى المختبر من أجل تحضير الكسوة الخزفية للأسنان.
قد تستغرق هذه العملية عدة أيام.
إذا لم يكن وضع أسنانك من الناحية التجميلية جيداً، يمكن وضع كسوة خزفية للأسنان بشكل مؤقت، الأمر الذي ينطوي على دفعة إضافية.  
عندما تكون الكسوات الخزفية جاهزة، يضع طبيب الأسنان كل وحدة كسوة على السن الملائم لها، من ثم يتحقق من مدى ملائمة الكسوة ملمسها ولونها للسن.
عندما تكون الكسوة ما تزال على أسنانك، تحقق من النتائج في المرآة، وركز بشكل خاص على لونها.
في هذه المرحلة، يكون ما يزال بالإمكان تعديل وتغيير لون كسوة الأسنان عن طريق تغيير لون الغراء الذي تحتها.
لا يمكن تغيير لون الكسوة بعد لصقها على الأسنان.
حتى يتم وضع الكسوة على السن، يمر السن بعملية تنظيف، كي يلتصق الغراء بالسن بشكل أفضل.
بعد تركيب كسوة السن باستخدام غراء خاص، تتم الإستعانة بشعاع ضوء خاص لكي يتصلب الغراء.
 
بعد العلاج:
 
تستغرق عملية التأقلم مع أسنانك الجديدة، التي تغير حجمها وشكلها، مدة أسبوع إلى أسبوعين.
يجب عليك أن تواظب على تنظيف أسنانك وعلى إستعمال الخيط السني يومياً.
بعد حوالي أسبوع - أسبوعين يطلب منك طبيب الأسنان العودة إلى العيادة بغرض المراجعة والمتابعة.  
 
تعتبر كسوة الأسنان نسخة مقبولةً عن الأسنان ولكنها ليست بديلا مثالياً.
ومن الشائع جدا أن نرى تغييرات طفيفة في لون كسوة الأسنان، والتي قد تظهر مع الوقت، كما يحدث مع الأسنان الطبيعية أيضاً.
على الرغم من ذلك، ليس هناك أدنى شك بأن كسوة الأسنان ستحسن إبتسامتك وتعزز ثقتك بنفسك.''',
    '''تهدف جراحة دواعم السن إلى علاج التهاب دواعم السن (Periodontitis)، الذي لا يتحسن أو الذي لا يمكن علاجه بوسائل علاج غير جراحية.
 
يحدث التهاب دواعم السن نتيجة للإصابة بعدوى جرثومية مزمنة، في الطبقات التي تحيط بالأسنان (التي من وظيفتها تقديم الدعم للسن)، يحدث الالتهاب أولا عن طريق تكون لويحة جرثومية على السن ومن بعد ذلك يتطور الالتهاب في الطبقات المحيطة بالسن، أي دواعم السن.
من شأن الالتهاب الشديد أن يتسبب بتدمير هذه الطبقات، وبخلق مسافات بين السن وبين نظام دعمه (تكون جيب)، وقد يصل الأمر الى تآكل العظم وانكشاف تام لجذر السن.
 
في معظم الحالات يكون علاج هذه الحالة علاجا محافظا (أي ليس جراحيا).
ولكن الحالات التي تتطلب إجراء جراحة دواعم السن هي الحالات الصعبة والتي لا تستجيب للعلاج المحافظ (تغطية جذر السن، وتقليل الجيوب)، أو الحالات التي يتفاقم بها الالتهاب – عيوب في أنسجة دواعم السن ناجمة عن استمرار المرض لفترة طويلة وعن انحسار دواعم السن (بناء نظام دعم السن من جديد، زراعة دواعم السن وغيرها..)
 
التحضير للجراحة:
 
يتم القيام بهذه الجراحة تحت تأثير التخدير الموضعي، بالرغم من أنه يمكن في يومنا هذا إجراء هذه الجراحة تحت تأثير التخدير العام.
قبل القيام بالجراحة يتوجب على المرضى القيام بتصوير أسنانهم بالأشعة، وفي بعض الحالات تكون هنالك حاجة للقيام بتصوير خاص (تصوير بانورامي) أو حتى تصوير مقطعي محوسب (CT).
 
لدى الأشخاص الذين يتمتعون بصحة جيدة، لا داعي لإجراء فحوصات أخرى خاصة. ولكن المرضى الذين يعتبرون أكثر عُرضة للإصابة بالتهاب الشغاف (Endocarditis)، كالأشخاص ذوي الصمامات الاصطناعية وغيرهم، يتحتم عليهم إعلام طبيب الأسنان حتى يزودهم بجرعة من المضادات الحيوية قبل القيام بالعلاج.  
 
قد يُطلب من الأشخاص الذين يعانون من اضطرابات في تخثر الدم, إجراء فحص دم لفحص وظائف التخثر لديهم قبل العملية الجراحية، ذلك أنهم عرضة للإصابة بالنزيف.
 
مجرى الجراحة:
 
يتم القيام بجراحة دواعم السن في عيادة الأسنان بظروف معقمة.
يتلقى المريض حقنة تخدير موضعي لدواعم السن، كما هو الحال في كل علاجات الأسنان الإعتيادية (في بعض الأحيان تكون هنالك حاجة لتوسيع نطاق التخدير، بحسب المواقع المتضررة في دواعم السن).  
 
بعد تخدير الموقع، يقوم الجراح بإبعاد طبقة دواعم السن قدر الإمكان عن السن، حتى ينكشف للطبيب مصدر الضرر بهذه الطبقات.
بعد ذلك يقوم الجراح بإزالة ترسبات الالتهاب المتصلبة على سطح السن (اللويحة الجرثومية المتراكمة بما في ذلك الأنسجة الملتهبة التي تحيط بالسن).
وهكذا يمكن لدواعم السن أن تحيط بالسن من جديد, بشكل أفضل.
في حال كان هنالك جيوب عميقة أو فقدان لمادة السن، قد يقوم الجراح بزرع أنسجة من دواعم السن أو أنسجة عظم في السن عن طريق ما يسمى بغرس الأنسجة - سديلة(flap).
في النهاية يتم تقريب دواعم السن مرة أخرى, ومن ثم تتم خياطتها.'''
  ];

  List<String> info5=[
    '''يعمل المفصَل الفكِّي الصَّدغي كمفصل منزلق يربط عظم الفك بالجمجمة.
يُوجَد مِفصل واحِد على كلِّ جانبٍ من جانِبَي الفك.
اضطرابات المفصَل الفكِّي الصَّدغي هو نوع من الاضطراب في الفكِّ الصَّدغي
وقد يُسبِّب ألمًا في مفاصل الفكِّ وفي العضلات التي تتحكَّم في حركته  
 
الأعراض
قد تتضمَّن علامات وأعراض اضطرابات المِفصل الصدغي الفكي ما يلي :
 
الشعور بألم، أو الشعور بألم عند اللمس في فكك.
ألم في مِفصل صدغي فكي أو كليهما.
ألم موجع في الأذن أو حولها.
صعوبة المضغ أو ألم أثناء المضغ
ألم مُوجِع بالوجه
إطباق المِفصل؛ مما يُصعِّب من فتح فمكَ وغلقه
 
حدوث صوت الطقة من مفصل الفك الصدغي
 
قد يكون الصوت مع الفتح او القفل او كلاهما، وبجهة او جهتين.
يحدث الصوت بسبب تحرك القرص الغضروفي "الديسك" داخل المفصل للأمام مع حركة عظم الفك السفلي عند فتح الفم ويعود معه للخلف عند إغلاق الفم، لامتصاص صدمات الحركة وبنفس الوقت يمنع احتكاك عظمي الفك والجمجمة عند الحركة للفتح والغلق وبجميع الاتجاهات  عند المضغ.
 
عندما يتحرك الغضروف من مكانه لوجود سلوك خاطيء خلال المضغ أو التعرض لإصابة فيبدأ في مضايقة عظم الفك عند الحركة فيحدث صوت الطقطقة.
 
يختلف المسبب اذا كانت الطقطقة بحهة واحدة عما اذا كانت بالجهتين وفي كلى الحالتين تبدأ بصوت بسيط بدون ألم ثم تتطور اذا لم يتم ايقاف المسبب لتصل الى أن تصبح متكررة مع كل حركة للفك ومن ثم مع ألم حتى تضيق فتحة الفم تدريجيا لأن الديسك قد بدأ في إعاقة عظم الفك من الحركة الكاملة لفتح الفم.
 
العلاج يختلف بحسب درجة تطور الحالة ويجب مراجعة المتخصص قبل تطورها لان العلاج غير الجراحي يكفي لغالبية الحالات ولا نلجأ للعلاج الجراحي الا عند تطور الحالة لتصل بالفم مغلق تماما او لاتستجيب للعلاجات غير الجراحية "التحفظية".
 
أخيراً .. قد تصادف من يقول لك ليس لها علاج او علاجها جراحي فقط رغم عدم تطورها .. ونصيحتي ان تتجاهل مثل هذه النصائح الخاطئة ان تبحث عن المتخصص بعلاج مشاكل مفصل الفك غير الجرّاح وهو من سيتقن العلاجات غير الجراحية ويقرر ان كانت حالتك تستدعي الاحالة للجرّاح ام لا.
 
عوامل الخطر
تشمل العوامل التي قد تَزيد من خطر الإصابة باضطرابات المِفصل الفكي الصدغي ما يلي :
 
أنواعًا مختلفة من التهاب المفاصل، مثل التهاب المفاصل الروماتويدي، والفُصال العظمي.
إصابة الفك
إطباقًا أو صريرًا دائمًا (مزمنًا) في الأسنان
من شأن بعض أمراض الأنسجة الضامة التي تُسبِّب مشاكل أن تُؤثِّر على المِفصل الصدغي الفكي.''',
    '''ما هو خيط الأسنان؟ وما هي فوائده لصحة الفم؟
هو عبارة عن خيط مصنوع من ألياف طبية رفيعة يستخدم في تنضيف الفجوات والفراغات بين الأسنان والأماكن الضيقة التي لا تستطيع الفرشاة الوصول إليها.
 
فوائده :
 
اكثر فاعلية
استخدام الخيط، قبل فرك الأسنان بالفرشاة أكثر فعالية من فرك الاسنان بالفرشاة بمفردها.
 
حماية اللثة
مكان التقاء الأسنان مع اللثة عبارة عن منطقة خصبة لنمو البكتيريا في الفم.
بقايا الطعام يمكن ان تدخل في منطقة التقاء الأسنان مع اللثة وبناء طبقة البلاك
وهذا يمكن أن يسبب في التهابات اللثة التي قد تكون مزمنة وفي النهاية يمكن ان تؤدي إلى فقدان الأسنان. 
خيط تنظيف الأسنان بإمكانه الدخول للفراغ الموجود بين الأسنان واللثة ويزيل بقايا الطعام وطبقة البلاك التي لا تستطيع فرشاة الاسنان إزالته.
 
توفير المال
كما هو معروف ان علاجات الأسنان ممكن أن تكون مكلفة جدا.
لكن استخدام الخيط يوميا بإمكانه أن يمنع أمراض اللثة والأسنان ويقلل عدد علاجات الأسنان أو حتى يلغيها تماما.
 
*ينصح بزيارة طبيب الأسنان للفحص كل ستة أشهر .. ولكن عند استخدام الخيط يمكن الاكتفاء بتلك الفحوصات بدون الخضوع لعلاجات الأسنان المكلفة.
 
الوقاية من الأمراض الأخرى
أمراض الأسنان واللثة يمكن أن تؤثر على الجسم أكتر من مجرد تغيير لون الأسنان، أو الشعور بعدم الراحة في الفم أو رائحة الفم الكريهة.
 
*تقول الدراسات أن البكتيريا التي تتكاثر في الفم غير الصحي يمكن انه تسبب الضرر لبقية الجسم وتتسبب في أمراض القلب، السكري وأمراض الجهاز التنفسي.
 
يمنع تراكم الجير
استخدام الخيط مرة واحدة في اليوم يسمح بإزالة بقايا الطعام من الأسنان التي تتراكم وتكون طبقة البلاك والتي تتحول فيما بعد إلى جير والذي لا يمكن إزالته بفرشاة الاسنان ولكن يمكن إزالته بواسطة طبيب الاسنان.
 
وهكذا فإن تنظيف الأسنان الأمثل لكل يوم يتضمن العوامل الثلاثة :
١- خيط تنظيف الأسنان "dental floss".
٢- فرك الاسنان بالفرشاة "tooth brush".
٣-استخدام غسول الفم "mouth wash".''',
    '''تستخدم فرشاة الأسنان للعناية الدورية بالفم ولإزالة الترسبات المتراكمه على الأسنان ولذلك فإن الفرشاة تعد مكاناً مناسباً جدا للبكتريا التي يمكن أن تسبب لنا أمراض مثل الزكام والانفلونزا.
فـ لذلك يجب تنظيف فرشاة الأسنان مرة واحدة أسبوعياً على الأقل عن طريق :
 
1) غسل فرشاة الأسنان بالماء الساخن، ثم غسلها وفرك شعيراتها بواسطة إصبع اليد تحت الماء البارد، وهذا مرة قبل ومرة بعد الاستخدام.
2) نقع فرشاة الأسنان في غسول الفم لمدة 30 ثانية.
3) وضع الفرشاة في ماء مغلى لمدة ٣ دقائق .. وهناك العديد من الطرق الأخرى.''',
    '''هناك عدة نصائح يجب اتباعها بعد خلع الضرس أو السن لتجنب حدوث أى التهابات أو مضاعفات وتشمل :
 
1-  وضع قطنة/شاش مكان خلع الضرس أو السنة لمدة ساعة مع الضغط عليها.
 
2-  الابتعاد عن المشوربات الساخنة أو المأكولات القاسية.
 
3-   الابتعاد عن التدخين لمدة 24 ساعة.
 
4-  المواظبة على شرب مشروبات باردة والمأكولات الطرية لمدة 24 ساعة.
 
5-  الابتعاد عن المضمضة سواء باستخدام الغسول أو المياه والملح أيضا 24 ساعة واستخدامها بعد مرور أول يوم.
 
6-   يمنع وضع اللسان أو الإصبع على مكان الخلع لتجنب النزيف.
 
7- تناول مضاد حيوى يصفه الطبيب الدكتور لمنع العدوى وتسكين الألم.
 
عليك أن تعلم أن الضرس إذا ترك دون تركيب بديل له يحدث ضمور وتآكل لعظام الفك فى منطقة خلع الضرس أو السن، مع ميل الأسنان حول هذا الفراغ بعد خلع الضرس، كما سيحدث تغيير فى تنظيم الأسنان فى الفك وبالتالى سيشعر الشخص بألم فى مفصل الفك مع فتح وغلق الفم والأكل مع سماع صوت طقطقة.
وننصح بـ أنه بعد خلع الضرس بأسبوع يجب تعويضه بعمل تركيب ثابت، أما فى حال خلع أكثر من ضرس أو سن يتم تعويضه بتركيبة متحركة أو ثابتة أو زراعة الأسنان.''',
    '''فائدة ضرس العقل انه
*يغلق المسافات بين الضروس عندما ينمو بشكل صحيح في مكانه لكي يمنع تراكم بقايا الطعام وله وظيفه مثل باقى الضروس في طحن الطعام
عدد ضروس العقل التي تظهر للانسان هي 4 ضروس
اثنان في الفك العلوى واثنان في الفك السفلى
 
ضرس العقل أحيانا يواجه مشاكل أثناء النمو والظهور في الفم فـ ممكن أن يكون
مدفوناً في اللثه لا يستطيع الظهور (impacted)
في هذه الحاله ممكن أن يكون حوله ألياف ويسبب مشاكل فـ يكون الأفضل إزالته/خلعه.
وممكن أن يظهر مائلاً ناحية الضرس الذى بجواره أو ناحية الخد وهذا يؤدي إلى مشاكل مثل صعوبة العض أو مضغ الطعام فـ يكون الأفضل إزالته/خلعه.''',
    '''يعتقد أغلبنا أن السكر هو سبب تسوس الأسنان
لكن ما لا تعرفه أن تسوس الأسنان له ثلاثة أسباب مع بعضها وهى السكريات والبكتيريا والزمن.
ولذلك إذا كنت معتاداً على غسيل أسنانك جيداً باستمرار بعد تناول الحلويات لن تصاب أسنانك بالتسوس.
كما أن اللُعاب يساعد على التخلص من السكر أولا بأول.''',
    '''البلاك عبارة عن طبقة رقيقة تتكون على الاسنان حيث يمكن ان يتكون في عدة ساعات بعد تناول الطعام والمشروبات السكرية، بينما الجير عبارة عن بلاك متكلس ويتكون في عدة أيام أو أسابيع، ويعتبر البلاك هو العامل الاساسي في تسوس الأسنان ومرض اللثة، لذلك يجب تنظيف الأسنان جيداً بعد تناول الطعام والمشروبات السكرية.''',
    '''الأسنان اللبنية تكون حساسة للتسوس، فهي غير محمية بشكل كبير من البكتيريا، ومن ثم من السهل إصابتها، فتسوس الأسنان اللبنية يؤدي لالتهاب قد يؤثر لاحقًا على الأسنان الدائمة.''',
    '''- رائحة الفم الكريهة
- تصبغ الأسنان
- التهاب فتحات الغدة اللعابية على سطح الفم
- زيادة تراكم الترسبات والجير على الأسنان
- زيادة فقدان العظام المحطية بالأسنان
- زيادة خطر الإصابة بأمراض اللثه، وهو سبب رئيسي لفقدان الأسنان
- تأخر عملية الشفاء بعد خلع الأسنان أو علاج اللثة أو جراحة الفم
- معدل نجاح أقل لإجراءات زراعة الأسنان
- زيادة خطر الإصابة بسرطان الفم
- تصبغ اللسان أو حصول حالة اللسان الشعري (hairy tongue)''',
    '''- عض باطن الخد
- قضم الأظافر والتي تؤدي لتآكل في سطح الأسنان
- القروح في الفم
- خراجات الفم
- التهاب اللثه
- رائحة الفم الكريهة
- جفاف الفم
- طحن الأسنان والذي يؤدي لتآكلها
- اضطراب المفصل الصدغي الفكي''',
    '''تحتوي المشروبات الغازية على أحماض تهاجم مينا الأسنان؛ وتتسبب في تكوين حفر في الطبقة العلوية للأسنان.
ويوجد مصدر آخر للأحماض في الفم وهي البكتريا التي تقوم بتحويل السكريات إلى أحماض، ويجب أن تعرف أن فم الإنسان يحتوي على ما يقرب من 300 نوع من أنواع البكتريا، لذلك يجب تنظيف الفم سريعا بعد الأكل، والشرب.''',
    '''1- احرص على زيارة طبيب الأسنان بانتظام
حفاظًا على صحة أسنانك، ينبغي أن تحرص على زيارة طبيبك بانتظام كل 6 أشهر.

2- اتبع الطريقة الصحيحة لاستخدام خيط الأسنان:قم بتكوين قوس حول الفم، باستخدام الخيط، وقم بتحريكه بلطف إلى أعلى وأسفل، واحذر أن تستخدمه بعنف كي لا تُحدِث جروحًا في اللثّة.

3- إذا تناولت مشروبًا حامضيًا، اتنظر ساعة قبل تنظيف أسنانك، حيث يمكن للحمض إضعاف مينا الأسنان خاصّتك، ومن ثمّ يُساعد التنظيف على إزالة تلك الأحماض.

4- عدد الأسنان اللبنية 20 سنا، وتبدأ بالبزوغ في الشهر السادس، بينما عدد الأسنان الدائمة 32 سنا، وتبدأ بالبزوغ في السنة السادسة من عمر الإنسان.

5- يوجد في فم الانسان 6 غدد لعابية كبيرة وعدة غدد لعابية أخرى صغيرة، وجميع هذه الغدد تفرز اللعاب الذي يساعد على مضغ الطعام، والكلام، ومنع تسوس الأسنان وأمراض اللثة.'''
  ];


  List<String> takwiimas2ela=[
    '''تعريف تقويم الاسنان''',
    '''تقويم أسنان''',
    '''الحالات التي يلزم لها تركيب تقويم أسنان''',
    '''أسباب عيوب إطباق الأسنان''',
    '''عواقب عدم انتظام الأسنان''',
    '''تصنيف عيوب إطباق الأسنان''',
    '''فحص وتشخيص عيوب الإطباق''',
    '''علاج عيوب إطباق الأسنان''',
    '''قلع الأسنان في تقويم الأسنان''',
    '''المثبت''',
    '''تقويم الأسنان الجراحي''',
  ];


  List<String> takwiiminfo=[
    '''تقويم الأسنان هو إحدى مجالات طب الأسنان التي تهتم بدراسة ومعالجة عيوب إطباق الأسنان ومشاكل الفكين (سوء إطباق الأسنان)، والذي قد يكون نتيجة لعدم انتظام الأسنان، أو لعلاقات الفك غير المتناسبة (بين الفكين العلوي والسفلي)، أو كليهما.
''',
    '''المعالجة التقويمية من الممكن أن تتعامل مع اصطفاف الأسنان فقط، أو من الممكن أن تكون بمراقبة وتعديل نمو الوجه والفكين. في الحالة الأخيرة هو أفضل تعريفها بأنها "جراحة العظام التقويمية" "dentofacial orthopedics").
المعالجة التقويمية يمكن أن تكون لأسباب جمالية بحتة فيما يتعلق بتحسين المظهر العام لأسنان المرضى، ويمكن أن تكون لإعادة بناء وتغيير المظهر الخارجي للوجه (تقويم الأسنان يُغير الثلثين الأسفلين للوجه). ومن الممكن أن تكون المعالجة التقويمية تهدف إلى إعادة وتنظيم الوظائف الفموية كالنطق و المضغ و الكلام.''',
    '''هناك مشاكل تستلزم تركيب تقويم للأسنان، منها :
1. بروز الأسنان العلوية الأمامية
وهذا من أكثر الأسباب شيوعاً لتركيب التقويم
2. تزاحم الأسنان
ويحدث عند الأشخاص الذين عندهم فك ضيق لا يتسع لكافة الأسنان، مما يؤدي إلى تزاحمها
3. الأسنان المطمورة
انطمار الأسنان هو عدم خروج السن من اللثة، حيث قد لا تظهر بعض أسنان البالغين بسبب نموها في غير موقعها
4. الإطباق العميق
وهو أن تغطي الأسنان السفلية نسبة كبيرة من الأسنان العلوية عند الإطباق
5. الإطباق المفتوح
وهو عدم إطباق الأسنان العلوية الأمامية على السفلية، فيكون هناك فراغ، وتكون هذه المشكلة في الغالب نتيجة مص الإبهامفي الطفولة لفترة طويلة''',
    '''أسنان مزدحمة
أسباب عيوب إطباق الأسنان عديدة، منها:
1. عدم تناسق حجم الأسنان مع حجم الفك.
2. زيادة أو نقصان عدد الأسنان.
3. بعض الأمراض الوراثية.
4. تعرض الجنين أو الطفل إلى عوامل خارجية.
5. بعض العادات السيئة مثل مصّ الأصابع، والاستخدام المتكرر للمصاصة (اللهاية) للأطفال.
6. القلع المبكر للأسنان اللبنية.
7. القلع المتأخر للأسنان اللبنية.
8. سوء العناية بالأسنان، وعدم الاهتمام بها
9. التنفس الفموي.''',
    '''تترتب على عيوب إطباق الاسنان عواقب عديدة منها:
1. تسوس الأسنان.
2. التسبب بالتهابات اللثة
3. أمراض ما حول الأسنان.
4. التعرض للكسر (خاصة القواطع الأمامية) وسقوط بعض الأسنان
5. مشاكل عملية مضغ الطعام.
6. مشاكل النطق والكلام.
7. طمر الأسنان.
8. مشاكل في المفصل الفكي.
9. تأثيرات نفسية.
''',
    '''حسب تصنيف أنجل تصنف عيوب إطباق الأسنان إلى:
• الصنف الأول.
• الصنف الثاني.
• الصنف الثالث.''',
    '''إن عملية فحص وتشخيص عيوب الإطباق ووضع خطة العلاج من الخطوات المهمة في علاج تقويم الأسنان وهذه الخطوة تتضمن:
1. تاريخ الحالة.
2. الفحص العام.
3. الفحص الداخلي والخارجي للوجه والأسنان.
4. الفحوصات الوظيفية.
5. دراسة قوالب الأسنان.
6. الفحوصات الشعائية.
7. الصور الفوتوغرافية.''',
    '''بريكيت لتقويم الأسنان هو من أحدث طرق التقويم
تقسم أجهزة تقويم الأسنان إلى أربعة أقسام:
1. جهاز تقويم الأسنان الثابت (Fixed Braces
يُعد الأكثر استخداماً من بين أجهزة التقويم، ولا يستطيع الشخص إزالته من تلقاء نفسه، يتكون من دعائم (Brackets) تلتصق بالسطح الخارجي لكل سن، وتوصل الدعائم مع بعضها باستخدام أسلاك
يصنع التقويم الثابت غالباً من المعدن، ولكن قد يكون هناك خيارات أخرى، مثل : المعدن الشفاف، التقويم الخزفي المصنوع من السيراميك، أو تقويم معدني مثبت على الأسطح الداخلية للأسنان.
2. جهاز تقويم الأسنان المتحرك
يعالج هذا التقويم مشاكل صغيرة، مثل : الاعوجاج الطفيف للأسنان ومشكلة مص الإبهام، لا يسمح بإزالة هذا التقويم إلا عند تناول الطعام أو الحاجة لتنظيف الأسنان أو تنظيف الجهاز نفسه
من الأمثلة عليه : منظمات الاستقامة، المثبتات، الموسع الحنكي
3. جهاز تقويم الأسنان الوظيفي (Function appliances)
يعالج المشكلة المتعلقة بمواقع الفكين، ويحسِّن إطباق الأسنان
ويتكون من زوج من الأجهزة البلاستيكية القابلة للإزالة، ويستخدم هذا الجهاز عادة قبل التقويم الثابت بهدف تقليل التباين بين الفكين والأسنان.
4. مِترسة الرأس (Headgear)
تستخدم مترسة الرأس أو حزام الرأس خارج الفم، وغالباً ما يتم ذلك تزامناً مع التقويم لتعديل مشكلة سوء الإطباق
مبدأ عمله هو توليد ضغط على التقويم من خلال لفائف (Coils) وخطافات (Hocks) وأربطة تقويم وغيرها، وتعطي أفضل النتائج عندما يكون الفك قيد النمو للأطفال واليافعين
لم يعد استخدامها شائعاً كما كان سابقاً، لكنها ليست معدومة.
''',
    ''' أحيانا يحتاج عملية تقويم الأسنان إلى قلع بعض الأسنان الدائمة وأكثر حالات القلع هي لسنّ الناجذ الأول.
     ولا يُستبعد في عملية تقويم الأسنان قلع أي سن آخر غير الناجذ الأول. 
من أجل الحفاظ على صحة الاسنان، وتجنب الحالة التي يكون فيها الولد مضطرا للخضوع لقلع الاسنان والعلاجات الاخرى، يجب التاكد من أن الطفل يقوم بالحفاظ على نظافة فمه من خلال فرك أسنانه بالفرشاة بالشكل صحيح واستخدام الخيط الطبي باستمرار.''',
    '''أجهزة تثبيت (هاولي)
بعد الانتهاء من عملية تقويم الأسنان يكون من الضروري استعمال المثبّت.
 والمثبّت هو جهاز متحرك يقوم بالاحتفاظ بالوضع النهائي للأسنان لحين تكوين وتكيّف الأنسجة المحيطة بالأسنان.
  وأنواع المثبت عديدة أشهرها الشفاف (clear orthodontic retainer) و مثبت هاولي (Hawley orthodontic retainer). يستعمل المثبت ليلا ولفترات تتباين حسب الحالة.
''',
    '''بعض حالات التقويم تحتاج إلى تدخّل جراحي تتلخص في تقديم أو إرجاع الفك (العلوي أو السفلي) أو كليهما معا.''',
  ];
}